convergence_study/mesh_convergence/cases/pcf_20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       156;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       164;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       204;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80;
        startFace       244;
    }
)

// ************************************************************************* //
